qwen25-coder/XML/51122.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pub="http://xmlns.oracle.com/apps/publicSector/configuration/sharedObjects/location/v1/service/LocationService/">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <pub:getLocation>\n         <!-- Optional: -->\n         <locationId>12345</locationId>\n      </pub:getLocation>\n   </soapenv:Body>\n</soapenv:Envelope>